<template>
  <TextPage :content="content" />
</template>

<script>
  import TextPage from '@/components/Text-page.vue';

  export default {
    name: "HowWorks",
    components: {
      TextPage
    },
    data: () => ({
      content: {
        header: 'Как это работает?',
        description: 'Сначала выделяется цветовой сегмент в фотографиях из вашего профиля (мы рассматриваем 12 последних фото), то есть для каждой фотографии выделяются 16 доминирующих цветов с помощью кластеризации. После этого фотографии сортируются по цвету. Далее выделяем из них те, которые похожи по цветовому сегменту и потом по формуле вычисляем близость этих фотографий. Если фото близки по цветовому сегменту, то считаем их похожими. Далее выделяется такой же фильтр, как и на похожих изображениях или строится свой на основе этих изображений, и накладывается на нашу фотографию.'
      }
    })
  }
</script>